# Projeto Análise de Jogos da Steam

# Pacotes e conexão com o PostgreSQL

In [51]:
import pandas as pd
import psycopg2
import pandasql as ps

In [52]:
conn = psycopg2.connect(
    host = "localhost", 
    database = "postgres",  
    user = "postgres", 
    password = "senha"  # lembrar de sempre verificar a senha
)

# TABLE games

### Tipagens

In [53]:
query = """
SELECT 
    COLUMN_NAME, DATA_TYPE 
FROM INFORMATION_SCHEMA.columns
WHERE table_schema = 'public' and table_name = 'games'
;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\1754061395.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

      column_name         data_type
0          app_id           integer
1           title              text
2    date_release              date
3             win           boolean
4             mac           boolean
5           linux           boolean
6          rating              text
7  positive_ratio           integer
8    user_reviews           integer
9     price_final  double precision

### Nulos

In [54]:
query = """
SELECT 
  COUNT(CASE WHEN app_id IS NULL THEN 1 END) AS null_app_id,
  COUNT(CASE WHEN title IS NULL THEN 1 END) AS null_title,
  COUNT(CASE WHEN date_release IS NULL THEN 1 END) AS null_date_release,
  COUNT(CASE WHEN win IS NULL THEN 1 END) AS null_win,
  COUNT(CASE WHEN mac IS NULL THEN 1 END) AS null_mac,
  COUNT(CASE WHEN linux IS NULL THEN 1 END) AS null_linux,
  COUNT(CASE WHEN rating IS NULL THEN 1 END) AS null_rating,
  COUNT(CASE WHEN positive_ratio IS NULL THEN 1 END) AS null_positive_ratio,
  COUNT(CASE WHEN user_reviews IS NULL THEN 1 END) AS null_user_reviews,
  COUNT(CASE WHEN price_final IS NULL THEN 1 END) AS null_price_final
FROM games; 
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\3616469742.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

,null_app_id,null_title,null_date_release,null_win,null_mac,null_linux,null_rating,null_positive_ratio,null_user_reviews,null_price_final
0,0,0,0,0,0,0,0,0,0,0

### Valores únicos

In [55]:
query = """
SELECT
    COUNT (DISTINCT title) AS unique_title,
    COUNT (DISTINCT date_release) AS unique_date_release,
    COUNT (DISTINCT rating) AS unique_rating
FROM games;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\2672720757.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

   unique_title  unique_date_release  unique_rating
0         45983                 4068              9

# TABLE users

### Tipagens

In [56]:
query = """
SELECT 
    COLUMN_NAME, DATA_TYPE 
FROM INFORMATION_SCHEMA.columns
WHERE table_schema = 'public' and table_name = 'users'
;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\149564614.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

  column_name data_type
0     user_id   integer
1    products   integer
2     reviews   integer

### Nulos

In [57]:
query = """
SELECT 
  COUNT(CASE WHEN user_id IS NULL THEN 1 END) AS null_user_id,
  COUNT(CASE WHEN products IS NULL THEN 1 END) AS null_products,
  COUNT(CASE WHEN reviews IS NULL THEN 1 END) AS null_reviews
FROM users;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\2290766721.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

   null_user_id  null_products  null_reviews
0             0              0             0

### Valores únicos

In [58]:
N/A # todas as variáveis são numéricas

NameError: name 'N' is not defined

# TABLE recommendations

### Tipagens

In [59]:
query = """
SELECT 
    COLUMN_NAME, DATA_TYPE 
FROM INFORMATION_SCHEMA.columns
WHERE table_schema = 'public' and table_name = 'recommendations'
;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\4071946325.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

      column_name         data_type
0          app_id           integer
1            date              date
2  is_recommended           boolean
3           hours  double precision
4         user_id           integer
5       review_id           integer

### Nulos

In [60]:
query = """
SELECT 
  COUNT(CASE WHEN app_id IS NULL THEN 1 END) AS null_app_id,
  COUNT(CASE WHEN date IS NULL THEN 1 END) AS null_date,
  COUNT(CASE WHEN is_recommended IS NULL THEN 1 END) AS null_is_recommended,
  COUNT(CASE WHEN hours IS NULL THEN 1 END) AS null_hours,
  COUNT(CASE WHEN user_id IS NULL THEN 1 END) AS null_user_id,
  COUNT(CASE WHEN review_id IS NULL THEN 1 END) AS null_review_id
FROM recommendations;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\184836268.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

,null_app_id,null_date,null_is_recommended,null_hours,null_user_id,null_review_id
0,0,0,0,0,0,0

### Valores únicos

In [61]:
query = """
SELECT
    COUNT (DISTINCT date) AS unique_date
FROM recommendations;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\1540368333.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

   unique_date
0         4442

# Perguntas

#### 1.  Quais são os 5 jogos mais caros e quando foram lançados?

Caso os jogos possuam valor igual, ordenar por data de lançamento mais antiga

In [62]:
query = """
SELECT
    title, date_release, price_final
FROM games
ORDER BY price_final DESC, date_release ASC
LIMIT 5;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\402506309.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

                                    title date_release  price_final
0  Clickteam Fusion 2.5 Developer Upgrade   2014-01-27       299.99
1                   Aartform Curvy 3D 3.0   2013-11-12       299.90
2                           Houdini Indie   2018-10-10       269.99
3           3DF Zephyr Lite Steam Edition   2016-02-02       199.99
4                   Derelict (DO NOT BUY)   2018-12-03       199.99

#### 2. Quais são os 5 jogos (não gratuitos) mais baratos e quando foram lançados?

Caso os jogos possuam valor igual, ordenar por data de lançamento mais antiga

In [63]:
query = """
SELECT
    title, date_release, price_final
FROM games
WHERE price_final > 0
ORDER BY price_final ASC, date_release ASC
LIMIT 5;
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\1282132606.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

                title date_release  price_final
0      UBERMOSH:BLACK   2016-02-17         0.27
1     UBERMOSH:WRAITH   2017-01-29         0.27
2              Ripple   2017-03-31         0.27
3  Aerial Destruction   2017-05-18         0.27
4      UBERMOSH Vol.5   2017-05-25         0.27

#### 3. Quais são os 10 jogos mais bem avaliados (avaliação "very positive") e com maior quantidade de reviews? São jogos pagos ou gratuitos?

In [64]:
query = """
SELECT
    title, rating, user_reviews, price_final
FROM games
WHERE rating = 'Very Positive'
ORDER BY user_reviews DESC
LIMIT 10
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\3017473359.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

                              title         rating  user_reviews  price_final
0  Counter-Strike: Global Offensive  Very Positive       6941137        14.99
1                            Dota 2  Very Positive       1930493         0.00
2                Grand Theft Auto V  Very Positive       1367837         0.00
3   Tom Clancy's Rainbow Six® Siege  Very Positive        939992        19.99
4                   Team Fortress 2  Very Positive        935635         0.00
5                              Rust  Very Positive        722973        39.99
6                     Apex Legends™  Very Positive        595999         0.00
7                          Among Us  Very Positive        575982         4.99
8                          Warframe  Very Positive        521366         0.00
9                         Destiny 2  Very Positive        519754         0.00

#### 4. Quantos jogos rodam nos três sistemas operacionais?

In [65]:
query = """
SELECT
    COUNT (title) AS all_OS
FROM games
WHERE (win = True) and (mac = True) and (linux = True)
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\870461804.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

   all_os
0    7197

#### 5. Quais são os 10 jogos com a maior quantidade de recomendações positivas?

In [68]:
 query = """

SELECT
    g.title,
    COUNT(is_recommended) AS recommended
FROM games AS g
JOIN recommendations AS r
    ON g.app_id = r.app_id
WHERE is_recommended = True
GROUP BY g.title
ORDER BY recommended DESC
LIMIT 10
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\188221287.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

                              title  recommended
0                              Rust       210471
1  Counter-Strike: Global Offensive       149923
2                  Wallpaper Engine       147084
3                         Fallout 4       119778
4                      No Man's Sky       115248
5                            Arma 3       105771
6             Red Dead Redemption 2       105378
7                Grand Theft Auto V       100584
8                    Sea of Thieves        98472
9                     Path of Exile        96500

#### 6. Qual é o id do usuário que fez mais recomendações?

In [69]:
 query = """
SELECT
    user_id, reviews
FROM users
ORDER BY (reviews) DESC
LIMIT 1
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\2996477005.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

   user_id  reviews
0  3632140      151

#### 7. Quantos jogos possui o usuário que mais fez recomendações?

In [70]:
 query = """
SELECT
    user_id, products
FROM users
WHERE user_id = (
    SELECT user_id
    FROM users
    ORDER BY reviews DESC
    LIMIT 1
)
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\2854500799.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

   user_id  products
0  3632140      1697

#### 8. Quantos jogos foram lançados em cada ano?

In [71]:
query = """
SELECT
    CAST(EXTRACT(YEAR from date_release) AS INT) AS year, COUNT (date_release)
FROM games
GROUP BY year
ORDER BY year ASC
"""

df = pd.read_sql_query(query, con = conn)
df

C:\Users\User\AppData\Local\Temp\ipykernel_3636\973847922.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

    year  count
0   1997      2
1   1998      1
2   1999      3
3   2000      2
4   2001      2
5   2002      1
6   2003      2
7   2004      4
8   2005      3
9   2006     55
10  2007     82
11  2008    145
12  2009    311
13  2010    278
14  2011    369
15  2012    552
16  2013    810
17  2014   1887
18  2015   2905
19  2016   4088
20  2017   4832
21  2018   5258
22  2019   4824
23  2020   5838
24  2021   6386
25  2022   6571
26  2023    857

#### 9. Quais são os 10 jogos com maior quantidade de horas jogadas?

In [72]:
 query = """
SELECT
    g.title,
    SUM(hours) AS total_hours_played
FROM games as g
JOIN recommendations AS r
    ON g.app_id = r.app_id
GROUP BY title
ORDER BY total_hours_played DESC
LIMIT 10
"""

df = pd.read_sql_query(query, con = conn)
df.round(0)

C:\Users\User\AppData\Local\Temp\ipykernel_3636\2139838140.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

                              title  total_hours_played
0                              Rust          85934114.0
1  Counter-Strike: Global Offensive          72117731.0
2                Grand Theft Auto V          41017087.0
3                 Hearts of Iron IV          39739693.0
4                     Path of Exile          36338993.0
5                            Arma 3          35835060.0
6                         Fallout 4          32567711.0
7     The Binding of Isaac: Rebirth          28870610.0
8                            Dota 2          27636511.0
9   Tom Clancy's Rainbow Six® Siege          24721686.0

#### 10. Qual a média mensal de horas jogadas em 2022 do jogo com maior quantidade de horas jogadas?

Ou seja, a média mensal de horas jogadas em 2022 do jogo "Rust", de acordo com a questão anterior

In [73]:
 query = """
SELECT
    CAST(EXTRACT(MONTH FROM date) AS INT) AS month,
    AVG(hours) AS avg_hours_played
FROM games as g
JOIN recommendations AS r
    ON g.app_id = r.app_id
WHERE
    g.title = (
    SELECT g.title
    FROM games as g
    JOIN recommendations AS r
        ON g.app_id = r.app_id
    GROUP BY title
    ORDER BY SUM(hours) DESC
    LIMIT 1
    ) AND
    EXTRACT(YEAR FROM date) = 2022
GROUP BY month
ORDER BY month
"""

df = pd.read_sql_query(query, con = conn)
df.round(2)

C:\Users\User\AppData\Local\Temp\ipykernel_3636\727441315.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, con = conn)

    month  avg_hours_played
0       1            329.70
1       2            342.94
2       3            347.13
3       4            344.81
4       5            345.78
5       6            332.89
6       7            301.31
7       8            301.24
8       9            327.59
9      10            331.58
10     11            311.89
11     12            272.56